 ### Automated Terraform Plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.vnet.random_uuid.telemetry[0]: Refreshing state... [id=76998b8d-ad33-14b4-b2e2-5b5c7ff6f33a]
module.identities.module.application_registration.random_uuid.maintainers: Refreshing state... [id=ef3d0c8a-98a1-7d1e-2c10-18f0815bd6c7]
module.vnet.data.modtm_module_source.telemetry[0]: Reading...
module.vnet.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.identities.data.azuread_application_published_app_ids.well_known: Reading...
module.identities.azuread_group.admin_kubernetes_cluster: Refreshing state... [id=/groups/0bc3f96c-4c3c-4872-ad07-6453e0458993]
module.identities.azuread_group.sensitive_data_observer: Refreshing state... [id=/groups/e2521269-f846-4f6d-a012-ffe87251fc2d]
module.identities.data.azuread_user.cluster_admin["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Reading...
module.identities.data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
module.identities.azuread_group.emergency_admin: Refreshing state... [id=/groups/ce8a3b5f-66c6-41a1-92f4-90868321a885]
module.identities.azuread_group.main_keyvault_secret_writer: Refreshing state... [id=/groups/c95a1359-d312-4224-88e6-236ab454edd7]
module.identities.data.azuread_user.telemetry_observer["3b48f167-cb68-4655-b45b-878e170af84d"]: Reading...
module.identities.data.azuread_service_principal.terraform: Reading...
module.identities.azuread_group.telemetry_observer: Refreshing state... [id=/groups/a1580a18-80b6-4439-9b23-ac9097850840]
module.identities.data.azuread_user.cluster_admin["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Reading...
module.identities.data.azuread_service_principal.terraform: Read complete after 1s [id=/servicePrincipals/8358d79e-6030-43d7-8c6f-7185ee41482e]
module.identities.data.azuread_user.cluster_admin["3b48f167-cb68-4655-b45b-878e170af84d"]: Reading...
module.identities.data.azuread_user.telemetry_observer["3b48f167-cb68-4655-b45b-878e170af84d"]: Read complete after 2s [id=/users/3b48f167-cb68-4655-b45b-878e170af84d]
module.identities.data.azuread_client_config.current: Reading...
module.identities.data.azuread_client_config.current: Read complete after 0s [id=aeade8c4-d4f7-4ae7-9149-4975fa3a7f91-a0e34ba0-b64c-49f4-8d94-1c74d7b3090e-8358d79e-6030-43d7-8c6f-7185ee41482e]
module.identities.data.azuread_user.telemetry_observer["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Reading...
module.identities.data.azuread_user.cluster_admin["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Read complete after 2s [id=/users/4b89a1f0-8038-4929-81e6-6d128dac7aa0]
module.identities.data.azuread_user.telemetry_observer["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Reading...
module.identities.data.azuread_user.cluster_admin["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Read complete after 2s [id=/users/084a1c45-5010-4aab-bab6-7b86a9d10e5c]
module.identities.data.azuread_user.main_keyvault_secret_writer["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Reading...
module.identities.data.azuread_user.main_keyvault_secret_writer["3b48f167-cb68-4655-b45b-878e170af84d"]: Reading...
module.identities.data.azuread_user.main_keyvault_secret_writer["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Reading...
module.identities.data.azuread_user.gitops_maintainer["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Reading...
module.identities.data.azuread_user.gitops_maintainer["3b48f167-cb68-4655-b45b-878e170af84d"]: Reading...
module.identities.data.azuread_user.gitops_maintainer["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Reading...
module.identities.azuread_group.devops: Refreshing state... [id=/groups/8a2bab6e-28e6-4ed2-a9f9-4826d81c9e76]
module.identities.data.azuread_user.cluster_admin["3b48f167-cb68-4655-b45b-878e170af84d"]: Read complete after 3s [id=/users/3b48f167-cb68-4655-b45b-878e170af84d]
module.identities.azuread_service_principal.msgraph: Refreshing state... [id=/servicePrincipals/29c402c3-5bb1-4677-9a9b-80f77cd74944]
module.identities.data.azuread_user.main_keyvault_secret_writer["3b48f167-cb68-4655-b45b-878e170af84d"]: Read complete after 1s [id=/users/3b48f167-cb68-4655-b45b-878e170af84d]
module.identities.azurerm_resource_group.core: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core]
module.identities.data.azuread_user.telemetry_observer["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Read complete after 3s [id=/users/4b89a1f0-8038-4929-81e6-6d128dac7aa0]
module.identities.data.azurerm_role_definition.contributor: Reading...
module.identities.data.azuread_user.telemetry_observer["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Read complete after 3s [id=/users/084a1c45-5010-4aab-bab6-7b86a9d10e5c]
module.identities.data.azuread_user.main_keyvault_secret_writer["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Read complete after 3s [id=/users/084a1c45-5010-4aab-bab6-7b86a9d10e5c]
module.vnet.data.azurerm_client_config.this: Reading...
module.vnet.data.azurerm_client_config.telemetry[0]: Reading...
module.vnet.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hMGUzNGJhMC1iNjRjLTQ5ZjQtOGQ5NC0xYzc0ZDdiMzA5MGU7b2JqZWN0SWQ9ODM1OGQ3OWUtNjAzMC00M2Q3LThjNmYtNzE4NWVlNDE0ODJlO3N1YnNjcmlwdGlvbklkPWJlNGU4MmZmLWJmODMtNDE3My1hNzUwLTE1ZTgwNzg0NTU3OTt0ZW5hbnRJZD1hZWFkZThjNC1kNGY3LTRhZTctOTE0OS00OTc1ZmEzYTdmOTE=]
module.vnet.data.azurerm_client_config.this: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hMGUzNGJhMC1iNjRjLTQ5ZjQtOGQ5NC0xYzc0ZDdiMzA5MGU7b2JqZWN0SWQ9ODM1OGQ3OWUtNjAzMC00M2Q3LThjNmYtNzE4NWVlNDE0ODJlO3N1YnNjcmlwdGlvbklkPWJlNGU4MmZmLWJmODMtNDE3My1hNzUwLTE1ZTgwNzg0NTU3OTt0ZW5hbnRJZD1hZWFkZThjNC1kNGY3LTRhZTctOTE0OS00OTc1ZmEzYTdmOTE=]
azurerm_resource_group.vnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002]
module.identities.data.azurerm_role_definition.grafana_viewer: Reading...
module.identities.data.azuread_user.gitops_maintainer["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Read complete after 2s [id=/users/084a1c45-5010-4aab-bab6-7b86a9d10e5c]
module.identities.data.azurerm_role_definition.reader: Reading...
module.identities.data.azuread_user.main_keyvault_secret_writer["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Read complete after 2s [id=/users/4b89a1f0-8038-4929-81e6-6d128dac7aa0]
module.identities.azurerm_resource_group.sensitive: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive]
module.identities.data.azurerm_role_definition.acr_pull: Reading...
module.identities.data.azurerm_subscription.current: Reading...
module.identities.data.azuread_user.gitops_maintainer["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Read complete after 2s [id=/users/4b89a1f0-8038-4929-81e6-6d128dac7aa0]
module.vnet.modtm_telemetry.telemetry[0]: Refreshing state... [id=e3830665-5033-472d-b083-dac2e3d36b94]
module.identities.azurerm_role_assignment.acrpush_terraform: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/5e0d0b65-123e-ab0c-da84-5b7be21f50b8]
module.identities.azurerm_user_assigned_identity.aks_workload_identity: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-identity]
module.identities.data.azurerm_role_definition.contributor: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c]
module.identities.azurerm_user_assigned_identity.document_intelligence_identity: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ManagedIdentity/userAssignedIdentities/document-intelligence-identity]
module.identities.data.azurerm_role_definition.reader: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7]
module.identities.azurerm_user_assigned_identity.psql_identity: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.ManagedIdentity/userAssignedIdentities/psql-identity]
module.identities.data.azuread_user.gitops_maintainer["3b48f167-cb68-4655-b45b-878e170af84d"]: Read complete after 2s [id=/users/3b48f167-cb68-4655-b45b-878e170af84d]
module.identities.azurerm_user_assigned_identity.ingestion_cache_identity: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ingestion-cache-identity]
module.identities.data.azurerm_role_definition.grafana_viewer: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/60921a7e-fef1-4a43-9b16-a26c52ad4769]
module.identities.azurerm_user_assigned_identity.ingestion_storage_identity: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ingestion-storage-identity]
module.identities.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.vnet.azapi_resource.vnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001]
module.identities.azurerm_role_definition.vnet_subnet_access: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Authorization/roleDefinitions/18b04605-8a08-943f-d7f4-cd94bb6825a2|/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.identities.data.azurerm_role_definition.acr_pull: Read complete after 1s [id=/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d]
module.identities.azurerm_role_definition.sensitive_data_observer: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Authorization/roleDefinitions/69aa2ed3-0bfc-6241-9c7f-99025a1ca95c|/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.identities.azurerm_role_definition.emergency_admin: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Authorization/roleDefinitions/6919f4e6-ac60-273a-799b-6391a47c5637|/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.identities.azurerm_role_definition.telemetry_observer: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Authorization/roleDefinitions/86d4fe1f-e563-db50-5c22-229bbed694a1|/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.identities.azurerm_role_definition.devops_preview: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Authorization/roleDefinitions/73e3f81e-c41c-319c-1e56-9a0e5b13a949|/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.perimeter.azurerm_resource_provider_registration.azure_monitor_provider: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Monitor]
module.perimeter.azurerm_resource_provider_registration.azure_alerts_provider: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.AlertsManagement]
module.perimeter.data.azurerm_subscription.current: Reading...
module.perimeter.azurerm_resource_provider_registration.azure_dashboard_provider: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Dashboard]
module.identities.azurerm_role_definition.acr_puller: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Authorization/roleDefinitions/a28645e6-e3b5-d06a-efae-cf6c1f7a02ce|/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.perimeter.data.azurerm_resource_group.core: Reading...
module.perimeter.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.identities.azurerm_role_assignment.telemetry_observer_group: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/231d6d8f-72c7-1496-027b-eead4944ee32]
module.perimeter.data.azuread_service_principal.terraform: Reading...
module.perimeter.data.azurerm_resource_group.sensitive: Reading...
module.identities.azurerm_role_assignment.telemetry_observer_users["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/48754221-b94f-56cc-f42c-e2f3486d7044]
module.identities.azurerm_role_assignment.telemetry_observer_users["3b48f167-cb68-4655-b45b-878e170af84d"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/2c73714b-80cb-20a0-a388-954e40792699]
module.identities.azurerm_role_assignment.telemetry_observer_users["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/7d00f0e9-e70e-93c3-422c-1594569674d8]
module.perimeter.azurerm_public_ip.aks_public_ip: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/publicIPAddresses/aks_public_ip]
module.perimeter.azurerm_dns_zone.dns_zone: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev]
module.perimeter.data.azurerm_resource_group.core: Read complete after 0s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core]
module.perimeter.azurerm_private_dns_zone.psql_private_dns_zone: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/privateDnsZones/psql.postgres.database.azure.com]
module.identities.azurerm_role_assignment.aks_workload_identity_cognitive_services_user: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/ce449bf6-a908-a5ed-c8b2-8c033f6e3a1c]
module.perimeter.data.azurerm_resource_group.sensitive: Read complete after 0s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive]
module.perimeter.azurerm_consumption_budget_subscription.subscription_budget: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Consumption/budgets/subscription_budget]
module.perimeter.azurerm_key_vault.main_kv: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain]
module.perimeter.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.OperationalInsights/workspaces/loganalytics]
module.perimeter.azurerm_key_vault.sensitive_kv: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive]
module.identities.module.application_registration.azuread_application.this: Refreshing state... [id=/applications/6b6c2e49-db15-4500-8491-928091137273]
module.vnet.module.subnet["snet-kv"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-key-vault]
module.vnet.module.subnet["snet-github"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-github-runners]
module.perimeter.data.azuread_service_principal.terraform: Read complete after 2s [id=/servicePrincipals/8358d79e-6030-43d7-8c6f-7185ee41482e]
module.vnet.module.subnet["snet-aks-nodes"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-nodes]
module.vnet.module.subnet["snet-psql"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-postgres]
module.vnet.module.subnet["snet-storage"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-storage]
module.vnet.module.subnet["snet-redis"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-redis]
module.vnet.module.subnet["snet-agw"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-application-gateway]
module.vnet.module.subnet["snet-cognitive"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-cognitive-services]
module.vnet.module.subnet["snet-aks-pods"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-nodes]
module.perimeter.azurerm_private_dns_zone_virtual_network_link.psql-private-dns-zone-vnet-link: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/privateDnsZones/psql.postgres.database.azure.com/virtualNetworkLinks/PsqlVnetZone.com]
module.identities.module.application_registration.azuread_application_app_role.maintainers: Refreshing state... [id=/applications/6b6c2e49-db15-4500-8491-928091137273/appRoles/ef3d0c8a-98a1-7d1e-2c10-18f0815bd6c7]
module.identities.module.application_registration.azuread_application_password.aad_app_password: Refreshing state... [id=6b6c2e49-db15-4500-8491-928091137273/password/e8eeba88-335e-4063-939f-d044a0db5696]
module.identities.module.application_registration.azuread_service_principal.this: Refreshing state... [id=/servicePrincipals/9be59ff9-066e-4ec1-bd1f-c784a0b35222]
module.identities.azurerm_role_assignment.kv_crypto_officer_terraform_assign: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/a75dfb6b-d8eb-ab20-322b-3972fa69cd9d]
module.identities.module.application_registration.azurerm_key_vault_secret.aad_app_gitops_client_id: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/aad-app-hello-azure-gitops-client-id/e44fd580241a4cd09957ddd5e04fecc2]
module.identities.azurerm_role_assignment.ingestion_storage_kv_secrets_reader: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/1e67574e-721e-0aba-6b2c-fb2c1f07f4f6]
module.identities.azurerm_role_assignment.kv_secrets_officer_terraform_assign: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/8293a17a-1dc6-ae20-0aa4-886a5061f79a]
module.identities.azurerm_role_assignment.ingestion_cache_kv_secrets_reader: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/df7d7f10-7ad1-3be9-9014-85b69b3d9146]
module.identities.azurerm_role_assignment.ingestion_cache_kv_key_reader: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/da8e3767-94e8-1bed-d548-810404e2cc88]
module.identities.module.application_registration.azurerm_key_vault_secret.aad_app_gitops_client_secret: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/aad-app-hello-azure-gitops-client-secret/e35b6b85ee6f445db9c7052e1034e22a]
module.identities.azurerm_role_assignment.psql_identity_role_assignment: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/21c1a0eb-b55f-ed53-4665-6bdc245d3824]
module.identities.azurerm_role_assignment.kv_access_administrator_terraform_assign: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/75d91065-c418-b3d6-edbe-df07b24a5de3]
module.identities.azurerm_role_assignment.ingestion_storage_kv_key_reader: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/39533832-cb83-89fb-6f5b-db9b5fae26d2]
module.workloads.random_password.rabbitmq_password_chat: Refreshing state... [id=none]
module.workloads.random_id.encryption_key_ingestion: Refreshing state... [id=WQqMaiJNHxeaxf_WdZftUZBNDhC4qB8uNDLmmgLZKXo]
module.workloads.random_password.zitadel_master_key: Refreshing state... [id=none]
module.identities.azurerm_role_assignment.kv_main_crypto_officer_terraform_assign: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/0fab207f-5718-9f61-c5ec-01509167a8ed]
module.identities.azurerm_role_assignment.main_keyvault_key_reader_users["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/e8a9af5e-a205-6ed1-1542-d2d10d30e24f]
module.identities.azurerm_role_assignment.main_keyvault_key_reader_users["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/efa83cc1-7c77-3d7d-24ef-1ae1899909f6]
module.identities.azurerm_role_assignment.main_keyvault_key_reader_users["3b48f167-cb68-4655-b45b-878e170af84d"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/c2a62998-6ab6-6c8e-f52c-2467a001775a]
module.workloads.random_password.zitadel_db_user_password: Refreshing state... [id=none]
module.workloads.data.azurerm_resource_group.sensitive: Reading...
module.workloads.random_password.postgres_password: Refreshing state... [id=none]
module.workloads.random_id.encryption_key_node_chat_lxm: Refreshing state... [id=z0Y2Y8gkXtmFyy4NQWtCd93iUMwXIkccgkRbwku6jTI]
module.workloads.random_password.postgres_username: Refreshing state... [id=none]
module.workloads.random_password.encryption_key_app_repository: Refreshing state... [id=none]
module.workloads.data.azurerm_client_config.current: Reading...
module.workloads.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hMGUzNGJhMC1iNjRjLTQ5ZjQtOGQ5NC0xYzc0ZDdiMzA5MGU7b2JqZWN0SWQ9ODM1OGQ3OWUtNjAzMC00M2Q3LThjNmYtNzE4NWVlNDE0ODJlO3N1YnNjcmlwdGlvbklkPWJlNGU4MmZmLWJmODMtNDE3My1hNzUwLTE1ZTgwNzg0NTU3OTt0ZW5hbnRJZD1hZWFkZThjNC1kNGY3LTRhZTctOTE0OS00OTc1ZmEzYTdmOTE=]
module.identities.azurerm_role_assignment.main_keyvault_secret_manager_group: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/3b647e15-e13b-1bdf-8486-ea2b6783926c]
module.identities.azurerm_role_assignment.kv_main_access_administrator_terraform_assign: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/42f09b09-1602-97f0-5657-16127e654dfa]
module.identities.azurerm_role_assignment.main_keyvault_secret_manager_users["3b48f167-cb68-4655-b45b-878e170af84d"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/d797a4ea-7700-a9f5-9e47-d93924469e66]
module.identities.azurerm_role_assignment.main_keyvault_secret_manager_users["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/6101cbe9-d470-9ecb-730e-8f344170d3f5]
module.identities.azurerm_role_assignment.main_keyvault_secret_manager_users["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/965a0c0b-9e8d-e934-2b99-f7cd727ab756]
module.workloads.data.azurerm_resource_group.sensitive: Read complete after 1s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive]
module.workloads.data.azurerm_resource_group.core: Reading...
module.identities.azurerm_role_assignment.kv_main_secrets_officer_terraform_assign: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/df45b6ec-315a-df28-00fe-f5355d0bc759]
module.workloads.azurerm_key_vault_secret.rabbitmq_password_chat: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/rabbitmq-password-chat/c8e9eb63974843b9af6a03f8c9549964]
module.workloads.azurerm_key_vault_secret.zitadel_pat: Refreshing state... [id=https://helloazuremain.vault.azure.net/secrets/manual-zitadel-scope-mgmt-pat/911cf66c91f5441293c6bc5323bde1dc]
module.workloads.azurerm_key_vault_secret.encryption_key_ingestion: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/encryption-key-ingestion/8e6a78709e3a4879adaba5e7babf61fe]
module.workloads.azurerm_key_vault_secret.zitadel_master_key: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/zitadel-master-key/06d9b867251e49388ae22b10f0f9249e]
module.workloads.data.azurerm_resource_group.core: Read complete after 1s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core]
module.workloads.azurerm_key_vault_secret.zitadel_db_user_password: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/zitadel-db-user-password/f523958b5faf4f42b92e3bd63017ecb9]
module.workloads.azurerm_key_vault_secret.encryption_key_node_chat_lxm: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/encryption-key-chat-lxm/c5daa93c7e6b469fbcd2a9ff2ac317d2]
module.workloads.azurerm_key_vault_secret.encryption_key_app_repository: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/encryption-key-app-repository/ecb4a6137af94e258f033644c90b63d2]
module.identities.module.application_registration.azuread_app_role_assignment.maintainers["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Refreshing state... [id=/servicePrincipals/9be59ff9-066e-4ec1-bd1f-c784a0b35222/appRoleAssignedTo/RRxKCBBQq0q6tnuGqdEOXLp7J-MOv-NPkQe2iH9dLPA]
module.identities.module.application_registration.azuread_app_role_assignment.maintainers["3b48f167-cb68-4655-b45b-878e170af84d"]: Refreshing state... [id=/servicePrincipals/9be59ff9-066e-4ec1-bd1f-c784a0b35222/appRoleAssignedTo/Z_FIO2jLVUa0W4eOFwr4TfXlHhG9Gl9Kkzst97V-2tc]
module.identities.module.application_registration.azuread_app_role_assignment.maintainers["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Refreshing state... [id=/servicePrincipals/9be59ff9-066e-4ec1-bd1f-c784a0b35222/appRoleAssignedTo/8KGJSziAKUmB5m0Sjax6oDLmhnY5-g5Immey6TbletI]
module.workloads.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerRegistry/registries/uniquehelloazure]
module.workloads.module.kubernetes_cluster.azurerm_log_analytics_workspace_table.basic_log_table["ContainerLogV2"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.OperationalInsights/workspaces/loganalytics/tables/ContainerLogV2]
module.workloads.module.kubernetes_cluster.azurerm_log_analytics_workspace_table.basic_log_table["AKSControlPlane"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.OperationalInsights/workspaces/loganalytics/tables/AKSControlPlane]
module.workloads.module.ingestion_storage.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.Storage/storageAccounts/helloazureingstorage]
module.workloads.module.redis.azurerm_redis_cache.arc: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.Cache/redis/uniquehelloazureredis]
module.workloads.module.ingestion_cache.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.Storage/storageAccounts/helloazureingcache]
module.workloads.module.kubernetes_cluster.azurerm_monitor_data_collection_endpoint.monitor_dce[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Insights/dataCollectionEndpoints/aks-cluster-monitor-dce]
module.workloads.module.kubernetes_cluster.azurerm_monitor_workspace.monitor_workspace[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Monitor/accounts/aks-cluster-monitor]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server.apfs: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql]
module.workloads.module.openai.azurerm_cognitive_account.aca["cognitive-account-swedencentral"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.CognitiveServices/accounts/cognitive-account-swedencentral]
module.workloads.module.application_gateway.azurerm_public_ip.appgw[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/publicIPAddresses/default-public-ip-name]
module.workloads.module.kubernetes_cluster.azurerm_monitor_data_collection_rule.ci_dcr: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Insights/dataCollectionRules/aks-cluster-ci-dcr]
module.workloads.module.document_intelligence.azurerm_cognitive_account.aca["swedencentral-form-recognizer"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.CognitiveServices/accounts/doc-intelligence-swedencentral-form-recognizer]
module.workloads.module.application_gateway.azurerm_web_application_firewall_policy.wafpolicy[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/default-waf-policy-name]
module.workloads.module.kubernetes_cluster.azurerm_dashboard_grafana.grafana[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Dashboard/grafana/aks-cluster-grafana]
module.workloads.module.kubernetes_cluster.azurerm_monitor_data_collection_rule.monitor_dcr[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Insights/dataCollectionRules/aks-cluster-monitor-dcr]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_configuration.parameters["azure.extensions"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/configurations/azure.extensions]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_configuration.parameters["max_connections"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/configurations/max_connections]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_configuration.parameters["enable_seqscan"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/configurations/enable_seqscan]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_database.destructible_database_server["theme"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/databases/theme]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_database.destructible_database_server["app-repository"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/databases/app-repository]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_database.destructible_database_server["chat"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/databases/chat]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_database.destructible_database_server["ingestion"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/databases/ingestion]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_database.destructible_database_server["scope-management"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/databases/scope-management]
module.workloads.azurerm_monitor_diagnostic_setting.acr_diagnostic[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerRegistry/registries/uniquehelloazure|log-helloazure]
module.workloads.module.openai.azurerm_cognitive_deployment.deployments["cognitive-account-swedencentral-gpt-35-turbo-0125"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.CognitiveServices/accounts/cognitive-account-swedencentral/deployments/gpt-35-turbo-0125]
module.workloads.module.openai.azurerm_cognitive_deployment.deployments["cognitive-account-swedencentral-gpt-4"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.CognitiveServices/accounts/cognitive-account-swedencentral/deployments/gpt-4]
module.workloads.module.openai.azurerm_cognitive_deployment.deployments["cognitive-account-swedencentral-text-embedding-ada-002"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.CognitiveServices/accounts/cognitive-account-swedencentral/deployments/text-embedding-ada-002]
module.perimeter.azurerm_dns_a_record.adnsar_root: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/A/@]
module.perimeter.azurerm_dns_a_record.adnsar_sub_domains["zitadel"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/A/id]
module.perimeter.azurerm_dns_a_record.adnsar_sub_domains["argo"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/A/argo]
module.perimeter.azurerm_dns_a_record.adnsar_sub_domains["api"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/A/api]
module.workloads.module.ingestion_storage.azurerm_storage_management_policy.default[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.Storage/storageAccounts/helloazureingstorage/managementPolicies/default]
module.workloads.module.ingestion_cache.azurerm_storage_management_policy.default[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.Storage/storageAccounts/helloazureingcache/managementPolicies/default]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vnet.azapi_resource.vnet has changed
  ~ resource "azapi_resource" "vnet" {
        id                        = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001"
        name                      = "vnet-001"
      ~ output                    = {
            id         = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001"
          ~ properties = {
              ~ subnets           = [
                    # (4 unchanged elements hidden)
                    {
                        properties = {
                            addressPrefixes   = [
                                "10.201.3.32/28",
                            ]
                            provisioningState = "Succeeded"
                        }
                    },
                  ~ {
                      ~ properties = {
                          ~ addressPrefixes   = [
                              ~ "10.201.2.0/24" -> "10.201.3.64/28",
                            ]
                            # (1 unchanged attribute hidden)
                        }
                    },
                  ~ {
                      ~ properties = {
                          ~ addressPrefixes   = [
                              ~ "10.201.3.64/28" -> "10.201.0.0/23",
                            ]
                            # (1 unchanged attribute hidden)
                        }
                    },
                  ~ {
                      ~ properties = {
                          - serviceEndpoints        = [
                              - {
                                  - locations         = [
                                      - "swedencentral",
                                      - "swedensouth",
                                    ]
                                  - provisioningState = "Succeeded"
                                },
                            ]
                            # (4 unchanged attributes hidden)
                        }
                    },
                ]
                # (3 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vnet.module.subnet["snet-aks-nodes"].azapi_resource.subnet has changed
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefixes                   = [
                  ~ "10.201.2.0/24" -> "10.201.0.0/23",
                ]
                # (11 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-nodes"
        name                      = "snet-aks-nodes"
      ~ output                    = {
            id         = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-nodes"
          ~ properties = {
              ~ addressPrefixes   = [
                  ~ "10.201.2.0/24" -> "10.201.0.0/23",
                ]
                # (1 unchanged attribute hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.identities.data.azurerm_kubernetes_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_kubernetes_cluster" "cluster" {
      + aci_connector_linux                              = (known after apply)
      + agent_pool_profile                               = (known after apply)
      + api_server_authorized_ip_ranges                  = (known after apply)
      + azure_active_directory_role_based_access_control = (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + current_kubernetes_version                       = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      + dns_prefix                                       = (known after apply)
      + fqdn                                             = (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      + id                                               = (known after apply)
      + identity                                         = (known after apply)
      + ingress_application_gateway                      = (known after apply)
      + key_management_service                           = (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      + kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      + kube_config                                      = (sensitive value)
      + kube_config_raw                                  = (sensitive value)
      + kubelet_identity                                 = (known after apply)
      + kubernetes_version                               = (known after apply)
      + linux_profile                                    = (known after apply)
      + location                                         = (known after apply)
      + microsoft_defender                               = (known after apply)
      + name                                             = "aks-cluster"
      + network_profile                                  = (known after apply)
      + node_resource_group                              = (known after apply)
      + node_resource_group_id                           = (known after apply)
      + oidc_issuer_enabled                              = (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      + resource_group_name                              = "resource-group-core"
      + role_based_access_control_enabled                = (known after apply)
      + service_mesh_profile                             = (known after apply)
      + service_principal                                = (known after apply)
      + storage_profile                                  = (known after apply)
      + tags                                             = (known after apply)
      + windows_profile                                  = (known after apply)
    }

  # module.identities.azurerm_federated_identity_credential.afic_workloads["assistants-core"] will be created
  + resource "azurerm_federated_identity_credential" "afic_workloads" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = (known after apply)
      + name                = "assistants-core"
      + parent_id           = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-identity"
      + resource_group_name = "resource-group-core"
      + subject             = "system:serviceaccount:unique:assistants-core"
    }

  # module.identities.azurerm_federated_identity_credential.afic_workloads["backend-service-chat"] will be created
  + resource "azurerm_federated_identity_credential" "afic_workloads" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = (known after apply)
      + name                = "backend-service-chat"
      + parent_id           = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-identity"
      + resource_group_name = "resource-group-core"
      + subject             = "system:serviceaccount:unique:backend-service-chat"
    }

  # module.identities.azurerm_federated_identity_credential.afic_workloads["backend-service-ingestion"] will be created
  + resource "azurerm_federated_identity_credential" "afic_workloads" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = (known after apply)
      + name                = "backend-service-ingestion"
      + parent_id           = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-identity"
      + resource_group_name = "resource-group-core"
      + subject             = "system:serviceaccount:unique:backend-service-ingestion"
    }

  # module.identities.azurerm_federated_identity_credential.afic_workloads["backend-service-ingestion-worker"] will be created
  + resource "azurerm_federated_identity_credential" "afic_workloads" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = (known after apply)
      + name                = "backend-service-ingestion-worker"
      + parent_id           = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-identity"
      + resource_group_name = "resource-group-core"
      + subject             = "system:serviceaccount:unique:backend-service-ingestion-worker"
    }

  # module.identities.azurerm_role_assignment.application_gateway_ingres_controller_contributor_role will be created
  + resource "azurerm_role_assignment" "application_gateway_ingres_controller_contributor_role" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.application_gateway_ingres_controller_reader_role will be created
  + resource "azurerm_role_assignment" "application_gateway_ingres_controller_reader_role" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.application_gateway_ingres_controller_vnet_subnet_access will be created
  + resource "azurerm_role_assignment" "application_gateway_ingres_controller_vnet_subnet_access" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "VNet Subnet Access (Preview)"
      + scope                            = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.cluster_rbac_admin_group will be created
  + resource "azurerm_role_assignment" "cluster_rbac_admin_group" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0bc3f96c-4c3c-4872-ad07-6453e0458993"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.cluster_rbac_admin_terraform will be created
  + resource "azurerm_role_assignment" "cluster_rbac_admin_terraform" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8358d79e-6030-43d7-8c6f-7185ee41482e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.cluster_rbac_admin_users["084a1c45-5010-4aab-bab6-7b86a9d10e5c"] will be created
  + resource "azurerm_role_assignment" "cluster_rbac_admin_users" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "084a1c45-5010-4aab-bab6-7b86a9d10e5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.cluster_rbac_admin_users["3b48f167-cb68-4655-b45b-878e170af84d"] will be created
  + resource "azurerm_role_assignment" "cluster_rbac_admin_users" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3b48f167-cb68-4655-b45b-878e170af84d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.cluster_rbac_admin_users["4b89a1f0-8038-4929-81e6-6d128dac7aa0"] will be created
  + resource "azurerm_role_assignment" "cluster_rbac_admin_users" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4b89a1f0-8038-4929-81e6-6d128dac7aa0"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.cluster_user_group will be created
  + resource "azurerm_role_assignment" "cluster_user_group" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0bc3f96c-4c3c-4872-ad07-6453e0458993"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Contributor Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.cluster_user_terraform will be created
  + resource "azurerm_role_assignment" "cluster_user_terraform" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8358d79e-6030-43d7-8c6f-7185ee41482e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Contributor Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.cluster_user_users["084a1c45-5010-4aab-bab6-7b86a9d10e5c"] will be created
  + resource "azurerm_role_assignment" "cluster_user_users" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "084a1c45-5010-4aab-bab6-7b86a9d10e5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Contributor Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.cluster_user_users["3b48f167-cb68-4655-b45b-878e170af84d"] will be created
  + resource "azurerm_role_assignment" "cluster_user_users" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3b48f167-cb68-4655-b45b-878e170af84d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Contributor Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.cluster_user_users["4b89a1f0-8038-4929-81e6-6d128dac7aa0"] will be created
  + resource "azurerm_role_assignment" "cluster_user_users" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4b89a1f0-8038-4929-81e6-6d128dac7aa0"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Contributor Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.csi_identity_secret_reader will be created
  + resource "azurerm_role_assignment" "csi_identity_secret_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.csi_identity_secret_reader_main_kv will be created
  + resource "azurerm_role_assignment" "csi_identity_secret_reader_main_kv" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.identities.azurerm_role_assignment.dns_contributor will be created
  + resource "azurerm_role_assignment" "dns_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev"
      + skip_service_principal_aad_check = true
    }

  # module.identities.azurerm_role_assignment.kubelet_identity_acr_puller_assignment will be created
  + resource "azurerm_role_assignment" "kubelet_identity_acr_puller_assignment" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull Principals"
      + scope                            = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.vnet.module.subnet["snet-aks-nodes"].azapi_resource.subnet will be updated in-place
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefixes                   = [
                  ~ "10.201.0.0/23" -> "10.201.2.0/24",
                ]
                # (11 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-nodes"
        name                      = "snet-aks-nodes"
      ~ output                    = {
          - id         = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-nodes"
          - properties = {
              - addressPrefixes   = [
                  - "10.201.0.0/23",
                ]
              - provisioningState = "Succeeded"
            }
          - type       = "Microsoft.Network/virtualNetworks/subnets"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.workloads.module.application_gateway.azurerm_application_gateway.appgw will be created
  + resource "azurerm_application_gateway" "appgw" {
      + enable_http2                = true
      + firewall_policy_id          = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/default-waf-policy-name"
      + id                          = (known after apply)
      + location                    = "swedencentral"
      + name                        = "hello-azure-appgw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "resource-group-core"
      + tags                        = {
          + "app" = "hello-azure"
        }

      + autoscale_configuration {
          + max_capacity = 2
          + min_capacity = 1
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "hello-azure-beap"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "hello-azure-be-htst"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
            # (4 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "hello-azure-feip"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/publicIPAddresses/default-public-ip-name"
        }
      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "hello-azure-privatefeip"
          + private_ip_address            = "10.201.3.6"
          + private_ip_address_allocation = "Static"
          + private_link_configuration_id = (known after apply)
          + subnet_id                     = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-application-gateway"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "hello-azure-feport"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "hello-azure-gwip"
          + subnet_id = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-application-gateway"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "hello-azure-feip"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "hello-azure-feport"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "hello-azure-httplstn"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
            # (4 unchanged attributes hidden)
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "hello-azure-beap"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "hello-azure-be-htst"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "hello-azure-httplstn"
          + id                          = (known after apply)
          + name                        = "hello-azure-rqrt"
          + priority                    = 19500
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + rewrite_rule_set {
          + id   = (known after apply)
          + name = "security-headers"

          + rewrite_rule {
              + name          = "set-hsts-header"
              + rule_sequence = 100

              + response_header_configuration {
                  + header_name  = "Strict-Transport-Security"
                  + header_value = "max-age=31536000; includeSubDomains"
                }
            }
          + rewrite_rule {
              + name          = "set-nosniff-header"
              + rule_sequence = 101

              + response_header_configuration {
                  + header_name  = "X-Content-Type-Options"
                  + header_value = "nosniff"
                }
            }
          + rewrite_rule {
              + name          = "set-xss-header"
              + rule_sequence = 102

              + response_header_configuration {
                  + header_name  = "X-XSS-Protection"
                  + header_value = "1; mode=block"
                }
            }
          + rewrite_rule {
              + name          = "set-ref-header"
              + rule_sequence = 103

              + response_header_configuration {
                  + header_name  = "Referrer-Policy"
                  + header_value = "same-origin"
                }
            }
          + rewrite_rule {
              + name          = "delete-server-header"
              + rule_sequence = 104

              + response_header_configuration {
                  + header_name  = "Server"
                    # (1 unchanged attribute hidden)
                }
            }
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + ssl_policy {
          + policy_name = "AppGwSslPolicy20220101"
          + policy_type = "Predefined"
        }
    }

  # module.workloads.module.application_gateway.azurerm_monitor_diagnostic_setting.agw_diagnostic[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "agw_diagnostic" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.OperationalInsights/workspaces/loganalytics"
      + name                           = "log-hello-azure-appgw"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false
        }
    }

  # module.workloads.module.kubernetes_cluster.azurerm_kubernetes_cluster.cluster will be created
  + resource "azurerm_kubernetes_cluster" "cluster" {
      + automatic_upgrade_channel           = "stable"
      + azure_policy_enabled                = true
      + cost_analysis_enabled               = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "aks-cluster"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.30.0"
      + local_account_disabled              = true
      + location                            = "swedencentral"
      + name                                = "aks-cluster"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = "resource-group-core-aks-nodes"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = true
      + private_dns_zone_id                 = "None"
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "resource-group-core"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "app" = "hello-azure"
        }
      + workload_identity_enabled           = true

      + auto_scaler_profile {
          + balance_similar_node_groups                   = false
          + daemonset_eviction_for_empty_nodes_enabled    = false
          + daemonset_eviction_for_occupied_nodes_enabled = true
          + empty_bulk_delete_max                         = (known after apply)
          + expander                                      = "least-waste"
          + ignore_daemonsets_utilization_enabled         = false
          + max_graceful_termination_sec                  = "14400"
          + max_node_provisioning_time                    = "15m"
          + max_unready_nodes                             = 3
          + max_unready_percentage                        = 45
          + new_pod_scale_up_delay                        = (known after apply)
          + scale_down_delay_after_add                    = (known after apply)
          + scale_down_delay_after_delete                 = (known after apply)
          + scale_down_delay_after_failure                = (known after apply)
          + scale_down_unneeded                           = "10m"
          + scale_down_unready                            = (known after apply)
          + scale_down_utilization_threshold              = "0.6"
          + scan_interval                                 = (known after apply)
          + skip_nodes_with_local_storage                 = false
          + skip_nodes_with_system_pods                   = true
        }

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = []
          + azure_rbac_enabled     = true
          + tenant_id              = "aeade8c4-d4f7-4ae7-9149-4975fa3a7f91"
        }

      + default_node_pool {
          + auto_scaling_enabled         = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 5
          + max_pods                     = (known after apply)
          + min_count                    = 2
          + name                         = "default"
          + node_count                   = (known after apply)
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = (known after apply)
          + os_disk_size_gb              = 100
          + os_disk_type                 = "Managed"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = {
              + "app" = "hello-azure"
            }
          + temporary_name_for_rotation  = "defaultrepl"
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_D2ps_v6"
          + vnet_subnet_id               = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-nodes"
          + workload_runtime             = (known after apply)
          + zones                        = [
              + "1",
              + "2",
              + "3",
            ]

          + upgrade_settings {
              + max_surge = "1"
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + ingress_application_gateway (known after apply)

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "2m"
        }

      + kubelet_identity (known after apply)

      + maintenance_window {
          + allowed {
              + day   = "Sunday"
              + hours = [
                  + 16,
                  + 17,
                  + 18,
                  + 19,
                  + 20,
                  + 21,
                  + 22,
                ]
            }
        }

      + microsoft_defender {
          + log_analytics_workspace_id = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.OperationalInsights/workspaces/loganalytics"
        }

      + monitor_metrics {
          + annotations_allowed = "true"
          + labels_allowed      = "true"
        }

      + network_profile {
          + dns_service_ip     = "172.20.0.10"
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "azure"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "172.20.0.0/16"
          + service_cidrs      = (known after apply)

          + load_balancer_profile {
              + backend_pool_type           = "NodeIPConfiguration"
              + effective_outbound_ips      = (known after apply)
              + idle_timeout_in_minutes     = 100
              + managed_outbound_ip_count   = (known after apply)
              + managed_outbound_ipv6_count = (known after apply)
              + outbound_ip_address_ids     = [
                  + "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/publicIPAddresses/aks_public_ip",
                ]
              + outbound_ports_allocated    = 0
            }

          + nat_gateway_profile (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id      = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.OperationalInsights/workspaces/loganalytics"
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }

      + storage_profile {
          + blob_driver_enabled         = true
          + disk_driver_enabled         = true
          + file_driver_enabled         = true
          + snapshot_controller_enabled = true
        }

      + timeouts {
          + update = "30m"
        }

      + windows_profile (known after apply)

      + workload_autoscaler_profile {
          + keda_enabled                    = true
          + vertical_pod_autoscaler_enabled = false
        }
    }

  # module.workloads.module.kubernetes_cluster.azurerm_kubernetes_cluster_node_pool.node_pool["rapid"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "node_pool" {
      + auto_scaling_enabled        = true
      + id                          = (known after apply)
      + kubelet_disk_type           = (known after apply)
      + kubernetes_cluster_id       = (known after apply)
      + max_count                   = 3
      + max_pods                    = (known after apply)
      + min_count                   = 0
      + mode                        = "User"
      + name                        = "rapid"
      + node_count                  = (known after apply)
      + node_labels                 = {
          + "lifecycle"   = "ephemeral"
          + "scalability" = "rapid"
        }
      + node_taints                 = [
          + "scalability=rapid:NoSchedule",
          + "lifecycle=ephemeral:NoSchedule",
        ]
      + orchestrator_version        = (known after apply)
      + os_disk_size_gb             = 100
      + os_disk_type                = "Managed"
      + os_sku                      = "AzureLinux"
      + os_type                     = "Linux"
      + priority                    = "Regular"
      + scale_down_mode             = "Delete"
      + spot_max_price              = -1
      + tags                        = {
          + "app" = "hello-azure"
        }
      + temporary_name_for_rotation = "rapidrepl"
      + ultra_ssd_enabled           = false
      + vm_size                     = "Standard_D8s_v4"
      + vnet_subnet_id              = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-nodes"
      + zones                       = [
          + "1",
          + "2",
          + "3",
        ]

      + upgrade_settings {
          + max_surge = "10%"
        }
    }

  # module.workloads.module.kubernetes_cluster.azurerm_kubernetes_cluster_node_pool.node_pool["steady"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "node_pool" {
      + auto_scaling_enabled        = true
      + id                          = (known after apply)
      + kubelet_disk_type           = (known after apply)
      + kubernetes_cluster_id       = (known after apply)
      + max_count                   = 4
      + max_pods                    = (known after apply)
      + min_count                   = 0
      + mode                        = "User"
      + name                        = "steady"
      + node_count                  = (known after apply)
      + node_labels                 = {
          + "lifecycle"   = "persistent"
          + "scalability" = "steady"
        }
      + node_taints                 = []
      + orchestrator_version        = (known after apply)
      + os_disk_size_gb             = 100
      + os_disk_type                = "Managed"
      + os_sku                      = "AzureLinux"
      + os_type                     = "Linux"
      + priority                    = "Regular"
      + scale_down_mode             = "Delete"
      + spot_max_price              = -1
      + tags                        = {
          + "app" = "hello-azure"
        }
      + temporary_name_for_rotation = "steadyrepl"
      + ultra_ssd_enabled           = false
      + vm_size                     = "Standard_D8as_v5"
      + vnet_subnet_id              = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-nodes"
      + zones                       = [
          + "1",
          + "2",
          + "3",
        ]

      + upgrade_settings {
          + max_surge = "30%"
        }
    }

  # module.workloads.module.kubernetes_cluster.azurerm_monitor_alert_prometheus_rule_group.cluster_level_alerts will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "cluster_level_alerts" {
      + cluster_name        = "aks-cluster"
      + description         = "Cluster level Alert RuleGroup-RecommendedAlerts"
      + id                  = (known after apply)
      + interval            = "PT5M"
      + location            = "swedencentral"
      + name                = "aks-cluster-cluster-level-alerts"
      + resource_group_name = "resource-group-core"
      + rule_group_enabled  = true
      + scopes              = (known after apply)
      + tags                = {
          + "app" = "hello-azure"
        }

      + rule {
          + alert       = "KubeCPUQuotaOvercommit"
          + annotations = {
              + "description" = "Cluster {{ $labels.cluster }} has overcommitted CPU resource requests for Namespaces. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/cluster-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = "sum(min without(resource) (kube_resourcequota{job=\"kube-state-metrics\", type=\"hard\", resource=~\"(cpu|requests.cpu)\"})) / sum(kube_node_status_allocatable{resource=\"cpu\", job=\"kube-state-metrics\"}) > 1.5"
          + for         = "PT5M"
          + labels      = {
              + "severity" = "warning"
            }
          + severity    = 3

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeMemoryQuotaOvercommit"
          + annotations = {
              + "description" = "Cluster {{ $labels.cluster }} has overcommitted memory resource requests for Namespaces. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/cluster-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = "sum(min without(resource) (kube_resourcequota{job=\"kube-state-metrics\", type=\"hard\", resource=~\"(memory|requests.memory)\"})) / sum(kube_node_status_allocatable{resource=\"memory\", job=\"kube-state-metrics\"}) > 1.5"
          + for         = "PT5M"
          + severity    = 3

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeContainerOOMKilledCount"
          + annotations = {
              + "description" = "Number of OOM killed containers is greater than 0. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/cluster-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = "sum by (cluster,container,controller,namespace) (kube_pod_container_status_last_terminated_reason{reason=\"OOMKilled\"} * on(cluster,namespace,pod) group_left(controller) label_replace(kube_pod_owner, \"controller\", \"$1\", \"owner_name\", \".*\")) > 0"
          + for         = "PT5M"
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeClientErrors"
          + annotations = {
              + "description" = "Kubernetes API server client '{{ $labels.job }}/{{ $labels.instance }}' is experiencing {{ $value | humanizePercentage }} errors. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/cluster-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = "(sum(rate(rest_client_requests_total{code=~\"5..\"}[5m])) by (cluster, instance, job, namespace) / sum(rate(rest_client_requests_total[5m])) by (cluster, instance, job, namespace)) > 0.01"
          + for         = "PT15M"
          + severity    = 3

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubePersistentVolumeFillingUp"
          + annotations = {
              + "description" = "Based on recent sampling, the PersistentVolume claimed by {{ $labels.persistentvolumeclaim }} in Namespace {{ $labels.namespace }} is expected to fill up within four days. Currently {{ $value | humanizePercentage }} is available. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/cluster-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = "kubelet_volume_stats_available_bytes{job=\"kubelet\"}/kubelet_volume_stats_capacity_bytes{job=\"kubelet\"} < 0.15 and kubelet_volume_stats_used_bytes{job=\"kubelet\"} > 0 and predict_linear(kubelet_volume_stats_available_bytes{job=\"kubelet\"}[6h], 4 * 24 * 3600) < 0 unless on(namespace, persistentvolumeclaim) kube_persistentvolumeclaim_access_mode{access_mode=\"ReadOnlyMany\"} == 1 unless on(namespace, persistentvolumeclaim) kube_persistentvolumeclaim_labels{label_excluded_from_alerts=\"true\"} == 1"
          + for         = "PT15M"
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT15M"
            }
        }
      + rule {
          + alert       = "KubePersistentVolumeInodesFillingUp"
          + annotations = {
              + "description" = "The PersistentVolume claimed by {{ $labels.persistentvolumeclaim }} in Namespace {{ $labels.namespace }} only has {{ $value | humanizePercentage }} free inodes. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/cluster-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = "kubelet_volume_stats_inodes_free{job=\"kubelet\"} / kubelet_volume_stats_inodes{job=\"kubelet\"} < 0.03"
          + for         = "PT15M"
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubePersistentVolumeErrors"
          + annotations = {
              + "description" = "The persistent volume {{ $labels.persistentvolume }} has status {{ $labels.phase }}. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/cluster-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = "kube_persistentvolume_status_phase{phase=~\"Failed|Pending\",job=\"kube-state-metrics\"} > 0"
          + for         = "PT15M"
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeDaemonSetNotScheduled"
          + annotations = {
              + "description" = "{{ $value }} Pods of DaemonSet {{ $labels.namespace }}/{{ $labels.daemonset }} are not scheduled. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/cluster-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = "kube_daemonset_status_desired_number_scheduled{job=\"kube-state-metrics\"} - kube_daemonset_status_current_number_scheduled{job=\"kube-state-metrics\"} > 0"
          + for         = "PT15M"
          + severity    = 3

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeDaemonSetMisScheduled"
          + annotations = {
              + "description" = "{{ $value }} Pods of DaemonSet {{ $labels.namespace }}/{{ $labels.daemonset }} are running where they are not supposed to run. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/cluster-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = "kube_daemonset_status_number_misscheduled{job=\"kube-state-metrics\"} > 0"
          + for         = "PT15M"
          + severity    = 3

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeQuotaAlmostFull"
          + annotations = {
              + "description" = "{{ $value | humanizePercentage }} usage of {{ $labels.resource }} in namespace {{ $labels.namespace }} in {{ $labels.cluster }}. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/cluster-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = "kube_resourcequota{job=\"kube-state-metrics\", type=\"used\"} / ignoring(instance, job, type)(kube_resourcequota{job=\"kube-state-metrics\", type=\"hard\"} > 0) > 0.9 < 1"
          + for         = "PT15M"
          + severity    = 3

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
    }

  # module.workloads.module.kubernetes_cluster.azurerm_monitor_alert_prometheus_rule_group.node_level_alerts will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_level_alerts" {
      + cluster_name        = "aks-cluster"
      + description         = "Node level alerts for unreachable Kubernetes nodes"
      + id                  = (known after apply)
      + interval            = "PT5M"
      + location            = "swedencentral"
      + name                = "aks-cluster-node-level-alerts"
      + resource_group_name = "resource-group-core"
      + rule_group_enabled  = true
      + scopes              = (known after apply)
      + tags                = {
          + "app" = "hello-azure"
        }

      + rule {
          + alert       = "KubeNodeUnreachable"
          + annotations = {
              + "description" = "{{ $labels.node }} in {{ $labels.cluster }} is unreachable."
            }
          + enabled     = true
          + expression  = <<-EOT
                (kube_node_spec_taint{job="kube-state-metrics",key="node.kubernetes.io/unreachable",effect="NoSchedule"} unless ignoring(key,value) kube_node_spec_taint{job="kube-state-metrics",key=~"ToBeDeletedByClusterAutoscaler|cloud.google.com/imminent-node-termination|aws-node-termination-handler/spot-itn"} == 1)
            EOT
          + for         = "PT15M"
          + labels      = {
              + "alert_name" = "KubeNodeUnreachable"
              + "team"       = "prod"
            }
          + severity    = 3

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeNodeReadinessFlapping"
          + annotations = {
              + "description" = "Node readiness is flapping."
            }
          + enabled     = true
          + expression  = "sum(changes(kube_node_status_condition{status=\"true\",condition=\"Ready\"}[15m])) by (cluster, node) > 2"
          + for         = "PT15M"
          + labels      = {
              + "alert_name" = "KubeNodeReadinessFlapping"
              + "team"       = "prod"
            }
          + severity    = 3

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
    }

  # module.workloads.module.kubernetes_cluster.azurerm_monitor_alert_prometheus_rule_group.pod_level_alerts will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "pod_level_alerts" {
      + cluster_name        = "aks-cluster"
      + description         = "Pod level Alert RuleGroup-RecommendedAlerts"
      + id                  = (known after apply)
      + interval            = "PT5M"
      + location            = "swedencentral"
      + name                = "aks-cluster-pod-level-alerts"
      + resource_group_name = "resource-group-core"
      + rule_group_enabled  = true
      + scopes              = (known after apply)
      + tags                = {
          + "app" = "hello-azure"
        }

      + rule {
          + alert       = "KubePVUsageHigh"
          + annotations = {
              + "description" = "Average PV usage on pod {{ $labels.pod }} in container {{ $labels.container }} is greater than 80%. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                avg by (namespace, controller, container, cluster) (
                  (kubelet_volume_stats_used_bytes{job="kubelet"} / on(namespace, cluster, pod, container) group_left
                  kubelet_volume_stats_capacity_bytes{job="kubelet"}) * on(namespace, pod, cluster) group_left(controller)
                  label_replace(kube_pod_owner, "controller", "$1", "owner_name", "(.*)")
                ) > 0.8
            EOT
          + for         = "PT15M"
          + labels      = {
              + "alert_name" = "KubePVUsageHigh"
            }
          + severity    = 3

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeDeploymentReplicasMismatch"
          + annotations = {
              + "description" = "Deployment {{ $labels.namespace }}/{{ $labels.deployment }} in {{ $labels.cluster}} replica mismatch. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                (
                  kube_deployment_spec_replicas{job="kube-state-metrics"} > kube_deployment_status_replicas_available{job="kube-state-metrics"}
                  and (changes(kube_deployment_status_replicas_updated{job="kube-state-metrics"}[10m]) == 0)
                )
            EOT
          + for         = "PT15M"
          + labels      = {
              + "alert_name" = "KubeDeploymentReplicasMismatch"
            }
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT15M"
            }
        }
      + rule {
          + alert       = "KubeStatefulSetReplicasMismatch"
          + annotations = {
              + "description" = "StatefulSet {{ $labels.namespace }}/{{ $labels.statefulset }} in {{ $labels.cluster}} replica mismatch. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                (
                  kube_statefulset_status_replicas_ready{job="kube-state-metrics"} != kube_statefulset_status_replicas{job="kube-state-metrics"}
                  and (changes(kube_statefulset_status_replicas_updated{job="kube-state-metrics"}[10m]) == 0)
                )
            EOT
          + for         = "PT15M"
          + labels      = {
              + "alert_name" = "KubeStatefulSetReplicasMismatch"
            }
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeHpaReplicasMismatch"
          + annotations = {
              + "description" = "Horizontal Pod Autoscaler in {{ $labels.cluster}} has not matched the desired number of replicas for longer than 15 minutes. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                (
                  kube_horizontalpodautoscaler_status_desired_replicas{job="kube-state-metrics"} != kube_horizontalpodautoscaler_status_current_replicas{job="kube-state-metrics"}
                  and (kube_horizontalpodautoscaler_status_current_replicas{job="kube-state-metrics"} > kube_horizontalpodautoscaler_spec_min_replicas{job="kube-state-metrics"})
                  and (kube_horizontalpodautoscaler_status_current_replicas{job="kube-state-metrics"} < kube_horizontalpodautoscaler_spec_max_replicas{job="kube-state-metrics"})
                  and (changes(kube_horizontalpodautoscaler_status_current_replicas{job="kube-state-metrics"}[15m]) == 0)
                )
            EOT
          + for         = "PT15M"
          + labels      = {
              + "alert_name" = "KubeHpaReplicasMismatch"
            }
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT15M"
            }
        }
      + rule {
          + alert       = "KubeHpaMaxedOut"
          + annotations = {
              + "description" = "Horizontal Pod Autoscaler in {{ $labels.cluster}} has been running at max replicas for longer than 15 minutes. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                kube_horizontalpodautoscaler_status_current_replicas{job="kube-state-metrics"} == kube_horizontalpodautoscaler_spec_max_replicas{job="kube-state-metrics"}
            EOT
          + for         = "PT15M"
          + labels      = {
              + "alert_name" = "KubeHpaMaxedOut"
            }
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT15M"
            }
        }
      + rule {
          + alert       = "KubePodCrashLooping"
          + annotations = {
              + "description" = "{{ $labels.namespace }}/{{ $labels.pod }} ({{ $labels.container }}) in {{ $labels.cluster}} is restarting {{ printf \"%.2f\" $value }} / second. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                max_over_time(kube_pod_container_status_waiting_reason{reason="CrashLoopBackOff", job="kube-state-metrics"}[5m]) >= 1
            EOT
          + for         = "PT15M"
          + labels      = {
              + "alert_name" = "KubePodCrashLooping"
            }
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubePodContainerRestart"
          + annotations = {
              + "description" = "Pod container restarted in last 1 hour. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                sum by (namespace, controller, container, cluster)
                (increase(kube_pod_container_status_restarts_total{job="kube-state-metrics"}[1h])
                * on(namespace, pod, cluster) group_left(controller)
                label_replace(kube_pod_owner, "controller", "$1", "owner_name", "(.*)")) > 0
            EOT
          + for         = "PT15M"
          + labels      = {
              + "alert_name" = "KubePodContainerRestart"
            }
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubePodReadyStateLow"
          + annotations = {
              + "description" = "Ready state of pods is less than 80%. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                sum by (cluster,namespace,deployment)
                (kube_deployment_status_replicas_ready) / sum by
                (cluster,namespace,deployment)(kube_deployment_spec_replicas) < .8 or sum
                by (cluster,namespace,deployment)(kube_daemonset_status_number_ready) /
                sum by (cluster,namespace,deployment)(kube_daemonset_status_desired_number_scheduled) < .8
            EOT
          + for         = "PT5M"
          + labels      = {
              + "alert_name" = "KubePodReadyStateLow"
            }
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT15M"
            }
        }
      + rule {
          + alert       = "KubePodFailedState"
          + annotations = {
              + "description" = "Number of pods in failed state are greater than 0. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                sum by (cluster, namespace, controller)
                    (kube_pod_status_phase{phase="failed"} * on(namespace, pod, cluster)
                    group_left(controller) label_replace(kube_pod_owner, "controller", "$1", "owner_name", "(.*)")) > 0
            EOT
          + for         = "PT5M"
          + labels      = {
              + "alert_name" = "KubePodFailedState"
            }
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT15M"
            }
        }
      + rule {
          + alert       = "KubePodNotReadyByController"
          + annotations = {
              + "description" = "{{ $labels.namespace }}/{{ $labels.pod }} in {{ $labels.cluster }} by controller is not ready. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                sum by (namespace, controller, cluster) (max by(namespace, pod, cluster)
                    (kube_pod_status_phase{job="kube-state-metrics", phase=~"Pending|Unknown"})
                    * on(namespace, pod, cluster) group_left(controller)
                    label_replace(kube_pod_owner, "controller", "$1", "owner_name", "(.*)")) > 0
            EOT
          + for         = "PT15M"
          + labels      = {
              + "alert_name" = "KubePodNotReadyByController"
            }
          + severity    = 3

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeStatefulSetGenerationMismatch"
          + annotations = {
              + "description" = "StatefulSet generation for {{ $labels.namespace }}/{{ $labels.statefulset }} does not match, this indicates that the StatefulSet has failed but has not been rolled back. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                kube_statefulset_status_observed_generation{job="kube-state-metrics"} !=
                    kube_statefulset_metadata_generation{job="kube-state-metrics"}
            EOT
          + for         = "PT15M"
          + labels      = {
              + "alert_name" = "KubeStatefulSetGenerationMismatch"
            }
          + severity    = 3

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeJobFailed"
          + annotations = {
              + "description" = "Job {{ $labels.namespace }}/{{ $labels.job_name }} in {{ $labels.cluster}} failed to complete. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                kube_job_failed{job="kube-state-metrics"} > 0
            EOT
          + for         = "PT15M"
          + labels      = {
              + "alert_name" = "KubeJobFailed"
            }
          + severity    = 3

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeContainerAverageCPUHigh"
          + annotations = {
              + "description" = "Average CPU usage per container is greater than 95%. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                sum (rate(container_cpu_usage_seconds_total{image!="", container!="POD"}[5m])) by (pod,cluster,container,namespace)
                / sum(container_spec_cpu_quota{image!="", container!="POD"}/container_spec_cpu_period{image!="", container!="POD"})
                by (pod,cluster,container,namespace) > .95
            EOT
          + for         = "PT5M"
          + labels      = {
              + "alert_name" = "KubeContainerAverageCPUHigh"
            }
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT15M"
            }
        }
      + rule {
          + alert       = "KubeContainerAverageMemoryHigh"
          + annotations = {
              + "description" = "Average Memory usage per container is greater than 95%. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                avg by (namespace, controller, container, cluster)(((container_memory_working_set_bytes{container!="", image!="", container!="POD"}
                / on(namespace,cluster,pod,container) group_left kube_pod_container_resource_limits{resource="memory", node!=""})
                *on(namespace, pod, cluster) group_left(controller) label_replace(kube_pod_owner, "controller", "$1", "owner_name", "(.*)")) > .95)
            EOT
          + for         = "PT10M"
          + labels      = {
              + "alert_name" = "KubeContainerAverageMemoryHigh"
            }
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
      + rule {
          + alert       = "KubeletPodStartUpLatencyHigh"
          + annotations = {
              + "description" = "Kubelet Pod startup latency is too high. For more information on this alert, please refer to this [link](https://aka.ms/aks-alerts/pod-level-recommended-alerts)."
            }
          + enabled     = true
          + expression  = <<-EOT
                histogram_quantile(0.99,
                    sum(rate(kubelet_pod_worker_duration_seconds_bucket{job="kubelet"}[5m]))
                    by (cluster, instance, le)) * on(cluster, instance) group_left(node)
                    kubelet_node_name{job="kubelet"} > 60
            EOT
          + for         = "PT10M"
          + labels      = {
              + "alert_name" = "KubeletPodStartUpLatencyHigh"
            }
          + severity    = 4

          + alert_resolution {
              + auto_resolved   = true
              + time_to_resolve = "PT10M"
            }
        }
    }

  # module.workloads.module.kubernetes_cluster.azurerm_monitor_data_collection_rule_association.ci_dcr_asc will be created
  + resource "azurerm_monitor_data_collection_rule_association" "ci_dcr_asc" {
      + data_collection_rule_id = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Insights/dataCollectionRules/aks-cluster-ci-dcr"
      + id                      = (known after apply)
      + name                    = "aks-cluster-ci-dcr-asc"
      + target_resource_id      = (known after apply)
    }

  # module.workloads.module.kubernetes_cluster.azurerm_monitor_data_collection_rule_association.monitor_dcr_asc[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "monitor_dcr_asc" {
      + data_collection_rule_id = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Insights/dataCollectionRules/aks-cluster-monitor-dcr"
      + description             = "Association of data collection rule. Deleting this association will break the data collection for this AKS Cluster."
      + id                      = (known after apply)
      + name                    = "aks-cluster-monitor-dcr-asc"
      + target_resource_id      = (known after apply)
    }

  # module.workloads.module.kubernetes_cluster.azurerm_monitor_diagnostic_setting.aks_diagnostic_logs will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks_diagnostic_logs" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.OperationalInsights/workspaces/loganalytics"
      + name                           = "aks-diagnostic-logs"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "cloud-controller-manager"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "cluster-autoscaler"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "csi-azuredisk-controller"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "csi-azurefile-controller"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "csi-snapshot-controller"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "kube-audit-admin"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "kube-scheduler"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false
        }
    }

Plan: 32 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + aks_cluster_id                                         = (known after apply)
  + cluster_kublet_client_id                               = (known after apply)
  + key_vault_secrets_provider_client_id                   = (known after apply)
  ~ subnets                                                = {
      ~ snet-aks-nodes = {
            name                                             = "snet-aks-nodes"
          ~ resource                                         = {
                id                               = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-nodes"
                name                             = "snet-aks-nodes"
              ~ output                           = {
                  - id         = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-nodes"
                  - properties = {
                      - addressPrefixes   = [
                          - "10.201.2.0/24",
                        ]
                      - provisioningState = "Succeeded"
                    }
                  - type       = "Microsoft.Network/virtualNetworks/subnets"
                } -> (known after apply)
                tags                             = null
                # (22 unchanged attributes hidden)
            }
            # (2 unchanged attributes hidden)
        }
        # (8 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @unique-dominik, Action: `pull_request`, Env: ``, Workflow: `[tf] Plan/Apply 10_azure`*